#include <iostream>
using namespace std;

/*
输出:
Test 1:
9       5       3       3       8       4       7
Test 2:
3       5
Test 3:
8       4       0x6ffdc8        3 

分析:
---------------------------------------------------------------------
a[4]          a[]的第五个元素
*(a+2)        a[]的第三个元素(地址再解引用)a[2]=5
*p[1]         p[]的第二个元素是(a+1),(a+1)再解引用后是a[1]=3 
**(p+1)       (p+1)解引用是p[1]=a+1,(a+1)再解引用后是a[1]=3 
**(p+1)+a[2]  同上,为a[1]+a[2]=8
*(p+4)-*(p-0) (p+4)解引用是p[4]=a+4,(p-0)解引用是p[0]=a,(a+4)-a为4
*(a+3)%a[4]   (a+3)解引用是a[3]=7,a[3]%a[4]=7 
---------------------------------------------------------------------
*(++p1)        p1一开始指向a,前置自增后p1=a+1,解引用即为a[1]=3
*(p1+2)        p1+2=a+2=a+2,解引用后即为a[2]=5
---------------------------------------------------------------------
sizeof p1     在本地电脑(64)位下,指针大小为8
sizeof *p1    *p1=a[1]为int,大小为4
&p1           取指针变量p1所在地址 
*p1           解引用p1即为a[1]=3
*/

int main() {
	int a[] = {1,3,5,7,9};
	int *p[] = {a,a+1,a+2,a+3,a+4};
	int *p1 = a;
	std::cout<<"Test 1:" << std::endl;
	std::cout<<a[4]<<"\t"<<*(a+2)<<"\t"<<*p[1]<<"\t"<<
	**(p+1)<<"\t"<<**(p+1)+a[2]<<"\t"<<*(p+4)-*(p-0)<<"\t"<<*(a+3)%a[4]<<std::endl;
	std::cout<<"Test 2:" <<std::endl;
	std::cout<<*(++p1)<<"\t"<<*(p1+2)<<std::endl;
//	std::cout<<*(++p1)<<"\t";
//	std::cout<<*(p1+2)<<std::endl;
	std::cout<<"Test 3:" <<std::endl;
	std::cout<<sizeof p1<<"\t"<<sizeof *p1 << "\t"<<&p1<<"\t"<<*p1<<std::endl;
	return 0;
}
